<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <title>Hilfe zu Matching Heuristiken</title>
</head>
<body bgcolor="#E3E3E3" background="../../../../img/lisa.gif">

<h2>
Matching Heuristiken</h2>
Diese Heuristiken erzeugen einen Plan f&uuml;r Open Shop Probleme. Dabei
wird versucht Operationen so anzuordnen, das solche mit &auml;hnlichen
Bearbeitungszeiten parallel laufen. Die Fortschrittsanzeige gibt die aktuelle
Gesamtbearbeitungszeit nach jedem Einf&uuml;gen an.
<h2>
So werden Matching Heuristiken gestartet:</h2>
Stellen sie sicher, das der <a href="../problem.html">Problemtyp</a> und alle
<a href="../values.html">Problemparameter</a>
definiert sind. W&auml;hlen sie <i>Heuristische Verfahren|Matching Heuristiken</i>
aus dem Menu <i>Algorithmen</i> , editieren sie die Optionen und&nbsp;
dr&uuml;cken sie <i>OK</i>.
<h2>
Optionen:</h2>

<dl>
<dt>
Art des Algorithmus:</dt>

<dl>
<dt>
BOTTLENECK</dt>

<dd>
Die Wichtungen werden sortiert, anschliessend wird die gr&ouml;sste Wichtung
p bestimmt, so das M = {p(i,j) | p(i,j) >= p} ein perfektes Matching enth&auml;lt.
Die entsprechenden Operationen aus diesem Matching werden in den Plan eingef&uuml;gt
und die Wichtungen gel&ouml;scht. Der Vorgang wir solange wiederholt, bis
alle Operationen in den Plan eingef&uuml;gt sind.</dd>

<dt>
WEIGHTED</dt>

<dd>
Ein maximal gewichtetes Matching wird berechnet. Die entsprechenden Operationen
werden in den Plan eingef&uuml;gt und die Wichtungen gel&ouml;scht (d.h.
auf den kleinsten zul&auml;ssigen Wert gesetzt). Der Vorgang wir solange
wiederholt, bis alle Operationen in den Plan eingef&uuml;gt sind.</dd>

<dd>
</dd>
</dl>

<dt>
Art des Matchings:</dt>

<dd>
&nbsp;Mit dieser Option legt man fest wie die Wichtungen berechnet werden.</dd>

<dl>
<dt>
MIN</dt>

<dd>
Die Bearbeitungszeiten werden vom gr&ouml;ssten zul&auml;ssigen Wert abgezogen,
das Ergebnis ergibt die Wichtung. Auf diese Weise wird die durchschnittliche
Bearbeitungszeit aller Operationen in einem Einf&uuml;geschritt minimiert.</dd>

<dt>
MAX</dt>

<dd>
Die Bearbeitungszeiten werden direkt als Wichtung benutzt. Auf diese Weise
wird die durchschnittliche Bearbeitungszeit aller Operationen in einem
Einf&uuml;geschritt maximiert.</dd>

<dt>
HEADS</dt>

<dd>
Die erste einzuf&uuml;gende Menge wird wie mit dem MIN Parameter berechnet.
Nachdem eine Menge von Operationen eingef&uuml;gt wurde werden f&uuml;r
alle noch nicht eingef&uuml;gten Operationen die Heads bestimmt. Diese
werden zur Bearbeitungszeit addiert und das Ergebnis wird vom gr&ouml;ssten
m&ouml;glichen Wert abgezogen. Dies ergibt die Wichtungen f&uuml;r das
n&auml;chste Matching. Auf diese Weise minimiert der Algorithmus in jedem
Schritt die aktuelle Gesamtbearbeitungszeit.</dd>
</dl>
</dl>

<hr><a href="../main.html">Inhaltsverzeichnis
<hr></a>29.10.00
</body>
</html>
